Project/Toir/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОбъектыРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресМестонахождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСерийныхЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Организация-изготовитель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтатусВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАктив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонтаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРемонта</name>
    <type>
      <types>EnumRef.торо_УсловияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.торо_ТипыОбъектовRCM</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КатегорияРиска</name>
    <type>
      <types>CatalogRef.торо_КатегорииРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КомментарийМатрицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсновноеСредство</name>
    <comment>TOIR20-222</comment>
    <type>
      <types>CatalogRef.гкс_ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МетодПланированияТоир</name>
    <type>
      <types>EnumRef.гкс_МетодыПланированияТоир</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КачественнаяОценка</name>
    <type>
      <types>EnumRef.гкс_КачественнаяОценкаКритичности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ВыборИзМатрицы</name>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИерархическиеСтруктурыОР</name>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОбъектыРемонтаГруппы/торо_ОбъектыРемонтаГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОбъектыРемонтаГруппы</name>
  <resources>
    <name>ОбъектГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СтатусыОРВУчете/торо_СтатусыОРВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыОРВУчете</name>
  <enumValues>
    <name>ПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_ОбъектыРемонта/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый() Тогда
		Если ПодразделениеИсполнитель <> Ссылка.ПодразделениеИсполнитель Тогда
			ДополнительныеСвойства.Вставить("НеобходимаРегистрацияЗаявокДляМобильныхБригад", Истина);
		КонецЕсли;
	Иначе
		Если ДополнительныеСвойства.Свойство("ТекСтруктураИерархии") И ДополнительныеСвойства.Свойство("РодительИерархии") Тогда
			СсылкаНаОбъект = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ЭтотОбъект);
			
			Попытка
				торо_РаботаСИерархией20.ВключитьНовыйОбъектРемонтаВИерархию(СсылкаНаОбъект, ДополнительныеСвойства.ТекСтруктураИерархии, ДополнительныеСвойства.РодительИерархии, Отказ, ОбменДанными.Загрузка);
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Исключение'"), УровеньЖурналаРегистрации.Предупреждение, 
					Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("НеобходимаРегистрацияЗаявокДляМобильныхБригад") Тогда
		СтруктураПараметров = Новый Структура("ИзменениеОР, ОбъектРемонта", Истина, Ссылка);
		Обмен_mobileBrigades_События.ЗарегистрироватьЗаявкиПриИзмененииПараметров(СтруктураПараметров);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УдалитьНаборСвойств = Неопределено;
	НеУчаствуетВПланировании = Ложь;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			
		Если ДанныеЗаполнения.Свойство("Основание") Тогда 
			ТиповойОР = ДанныеЗаполнения.Основание; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования") И НЕ ЭтоГруппа Тогда
		ЗначениеПеречисления = Перечисления.торо_СтатусыОРВУчете.НеПринятоКУчету;
		Структура = торо_СтатусыОРВУчете.НастройкиСтатуса(ЗначениеПеречисления);
		Если Структура <> Неопределено Тогда
			НеУчаствуетВПланировании = Структура.ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(Направление) Тогда 
			Направление = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновноеНаправлениеОР");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПлановыйГрафикРаботы) Тогда 
			ПлановыйГрафикРаботы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойГрафикРаботы");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если не ЭтоГруппа Тогда
		Если ВнешнийОбъект Тогда
			НеПроверяемыеРеквизиты.Добавить("Организация");
		Иначе 
			НеПроверяемыеРеквизиты.Добавить("Контрагент");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Нужно проверить, остались ли родители группами.
	// Регистр торо_ОбъектыРемонтаГруппы используется только в иерархиях, неизменяемых документами.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии КАК СтруктураИерархии,
	|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
	|ПОМЕСТИТЬ ВТ_ТаблицаРодителейПоИерархиям
	|ИЗ
	|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
	|ГДЕ
	|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии = &ОбъектИерархии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РодительИерархии,
	|	СтруктураИерархии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаРодителейПоИерархиям.СтруктураИерархии КАК СтруктураИерархии,
	|	ВТ_ТаблицаРодителейПоИерархиям.РодительИерархии КАК РодительИерархии,
	|	СУММА(ВЫБОР
	|			КОГДА торо_ИерархическиеСтруктурыОР.ОбъектИерархии = &ОбъектИерархии
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК НовоеКоличествоПодчиненных
	|ПОМЕСТИТЬ ВТ_НовоеКоличествоПодчиненных
	|ИЗ
	|	ВТ_ТаблицаРодителейПоИерархиям КАК ВТ_ТаблицаРодителейПоИерархиям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
	|		ПО ВТ_ТаблицаРодителейПоИерархиям.СтруктураИерархии = торо_ИерархическиеСтруктурыОР.СтруктураИерархии
	|			И ВТ_ТаблицаРодителейПоИерархиям.РодительИерархии = торо_ИерархическиеСтруктурыОР.РодительИерархии
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаРодителейПоИерархиям.СтруктураИерархии,
	|	ВТ_ТаблицаРодителейПоИерархиям.РодительИерархии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РодительИерархии,
	|	СтруктураИерархии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НовоеКоличествоПодчиненных.СтруктураИерархии КАК СтруктураИерархии,
	|	ВТ_НовоеКоличествоПодчиненных.РодительИерархии КАК РодительИерархии
	|ИЗ
	|	РегистрСведений.торо_ОбъектыРемонтаГруппы КАК торо_ОбъектыРемонтаГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НовоеКоличествоПодчиненных КАК ВТ_НовоеКоличествоПодчиненных
	|		ПО торо_ОбъектыРемонтаГруппы.ОбъектИерархии = ВТ_НовоеКоличествоПодчиненных.РодительИерархии
	|			И торо_ОбъектыРемонтаГруппы.СтруктураИерархии = ВТ_НовоеКоличествоПодчиненных.СтруктураИерархии
	|ГДЕ
	|	ВТ_НовоеКоличествоПодчиненных.НовоеКоличествоПодчиненных = 0";
	
	Запрос.УстановитьПараметр("ОбъектИерархии", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		торо_РаботаСИерархией20.ИзменитьЗаписьВРСторо_ОбъектыРемонтаГруппы(Выборка.РодительИерархии, Выборка.СтруктураИерархии, Ложь);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
